Res-Latency-social1/Res-container-set-v1/container_t_10_c_30_composePosts_composeCore_4_wrkCore_1_R_1600/wrk.txt
Running 1m test @ http://localhost:8080/wrk2-api/post/compose
  10 threads and 30 connections
  Thread calibration: mean lat.: 4.878ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 4.487ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.796ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.451ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 5.053ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.520ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.709ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.602ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.953ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.899ms, rate sampling interval: 12ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     4.12ms    4.25ms  24.03ms   94.83%
    Req/Sec   167.09    123.72   500.00     69.41%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.10ms
 75.000%    3.98ms
 90.000%    5.86ms
 99.000%   24.03ms
 99.900%   54.72ms
 99.990%   80.70ms
 99.999%   92.35ms
100.000%   94.33ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.247     0.000000            1         1.00
       2.279     0.100000         8022         1.11
       2.507     0.200000        16091         1.25
       2.697     0.300000        24083         1.43
       2.891     0.400000        32079         1.67
       3.101     0.500000        40124         2.00
       3.227     0.550000        44109         2.22
       3.363     0.600000        48144         2.50
       3.519     0.650000        52118         2.86
       3.721     0.700000        56132         3.33
       3.981     0.750000        60139         4.00
       4.147     0.775000        62153         4.44
       4.347     0.800000        64130         5.00
       4.607     0.825000        66151         5.71
       4.919     0.850000        68162         6.67
       5.315     0.875000        70146         8.00
       5.563     0.887500        71148         8.89
       5.855     0.900000        72155        10.00
       6.203     0.912500        73151        11.43
       6.679     0.925000        74155        13.33
       7.419     0.937500        75153        16.00
       7.911     0.943750        75653        17.78
       8.575     0.950000        76154        20.00
       9.447     0.956250        76657        22.86
      10.695     0.962500        77161        26.67
      12.303     0.968750        77657        32.00
      13.551     0.971875        77909        35.56
      14.751     0.975000        78160        40.00
      16.527     0.978125        78410        45.71
      18.111     0.981250        78659        53.33
      20.063     0.984375        78912        64.00
      21.039     0.985938        79035        71.11
      22.095     0.987500        79160        80.00
      23.343     0.989062        79288        91.43
      24.767     0.990625        79411       106.67
      26.687     0.992188        79536       128.00
      27.727     0.992969        79599       142.22
      28.847     0.993750        79662       160.00
      30.319     0.994531        79725       182.86
      32.095     0.995313        79787       213.33
      34.271     0.996094        79850       256.00
      35.391     0.996484        79883       284.44
      36.383     0.996875        79912       320.00
      38.015     0.997266        79943       365.71
      39.743     0.997656        79975       426.67
      41.663     0.998047        80006       512.00
      43.167     0.998242        80023       568.89
      45.023     0.998437        80037       640.00
      48.863     0.998633        80053       731.43
      51.199     0.998828        80069       853.33
      55.071     0.999023        80084      1024.00
      56.447     0.999121        80092      1137.78
      58.687     0.999219        80100      1280.00
      60.287     0.999316        80108      1462.86
      61.791     0.999414        80116      1706.67
      63.167     0.999512        80123      2048.00
      65.663     0.999561        80127      2275.56
      66.751     0.999609        80131      2560.00
      68.415     0.999658        80135      2925.71
      70.207     0.999707        80139      3413.33
      71.039     0.999756        80143      4096.00
      71.423     0.999780        80145      4551.11
      73.279     0.999805        80147      5120.00
      74.559     0.999829        80149      5851.43
      76.543     0.999854        80151      6826.67
      79.935     0.999878        80153      8192.00
      80.703     0.999890        80154      9102.22
      81.279     0.999902        80155     10240.00
      82.239     0.999915        80156     11702.86
      86.207     0.999927        80157     13653.33
      87.871     0.999939        80158     16384.00
      87.871     0.999945        80158     18204.44
      89.087     0.999951        80159     20480.00
      89.087     0.999957        80159     23405.71
      89.727     0.999963        80160     27306.67
      89.727     0.999969        80160     32768.00
      89.727     0.999973        80160     36408.89
      92.351     0.999976        80161     40960.00
      92.351     0.999979        80161     46811.43
      92.351     0.999982        80161     54613.33
      92.351     0.999985        80161     65536.00
      92.351     0.999986        80161     72817.78
      94.335     0.999988        80162     81920.00
      94.335     1.000000        80162          inf
#[Mean    =        4.120, StdDeviation   =        4.253]
#[Max     =       94.272, Total count    =        80162]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  96072 requests in 1.00m, 19.70MB read
Requests/sec:   1600.97
Transfer/sec:    336.14KB